#include <stdio.h>
// *****
// ****
// ***
// **
// *
// 반복문 2개
// 큰 반복문: 5번 반복
//  ㄴ 작은 반복문: 별갯수 찍기
int main(void) {
    // for(int i=0; i<5; i++) {  // 5번 반복
    //     for(int j=0; j<i+1; j++) { // 별 갯수 
    //         printf("*");
    //     }
    //     printf("\n");
    // }

    /**
     * i   j
     * 0   1  *
     * 1   2  **
     * 2   3  ***
     * 3   4  ****
     * 4   5  *****
    */

    for(int i=0; i<5; i++) {  // 5번 반복
        for(int j=5; j>i; j--) { // 별 갯수 
            printf("*");
        }
        printf("\n");
    }
    /**
     * i   j=5     j>i
     * 0   54321  *****
     * 1   5432   ****
     * 2   543    ***
     * 3   54     **
     * 4   5      *
    */
}